package Test;

/*
* array 排序
* 衡量排序算法優劣
* 1. 時間複雜度: 分析關鍵字的比較次數與記錄的移動次數
* 2. 空間複雜度: 分析過程中需要多少記憶體
* 3. 穩定性: 若兩個紀錄 A 和 B 的關鍵值 相等，排序後A B的先後順序沒動，則稱為穩定
* 例如: {2,6,5,A=3, 9,7,B=3} 排序後: {2, A=3, B=3, 5, 6, 7, 9}穩定!
* 排序後: {2, B=3, A=3, 5, 6, 7, 9}不穩定
*
* 排序可以分成
* a. 內部排序
* 1. 選擇排序 : 直接選擇排序、堆排法 (概念要會)
* 2. 交換排序 : 冒泡排序、快速排序 (這兩個要會寫!)
* 3. 插入排序 : 直接插入排序、折半插入排序、Shell排序
* 4. 歸併排序 (概念要會)
* 5. 桶式排序
* 6. 基數排序
*
* b. 外部排序 (排序過程中需要依靠額外的儲存硬體協助，例如外接硬碟等等)
*
*
*
* * 算法的5大特徵:
 * 1. Input
 * 2. Output
 * 3. Finiteness 有限性
 * 4. Definiteness 明確性
 * 5. Effectiveness 可行性
 *
* */
public class Array_Test8 {
    public static void main(String[] args) {


    }
}
